In [1]:
from sklearn.utils import resample
import pandas as pd

In [2]:
df=pd.read_csv('data.csv')
df.columns=["text","value"]

In [3]:
df

                                                    text  value
0      sickening i hurt for florida later for the wha...      4
1      this rainfall is a savage y fall when am in d ...      4
2      angry guy screws his gf in very rude manner po...      4
3      silence is better when you re angry and frustr...      4
4      it s your smile which makes me cool and calm w...      4
...                                                  ...    ...
47282  okla man learns fate for hate crime slaying of...      3
47283  i am positive that i want to stay uplifted des...      3
47284  okla man sentenced for hate crime slaying of l...      3
47285  just opened this on a train i really hate twit...      3
47286  we too are dreamers and angry screamers some b...      3

[47287 rows x 2 columns]

In [4]:
df = df.drop_duplicates(subset=['text'], keep='first')

In [5]:
df

                                                    text  value
0      sickening i hurt for florida later for the wha...      4
1      this rainfall is a savage y fall when am in d ...      4
2      angry guy screws his gf in very rude manner po...      4
3      silence is better when you re angry and frustr...      4
4      it s your smile which makes me cool and calm w...      4
...                                                  ...    ...
47282  okla man learns fate for hate crime slaying of...      3
47283  i am positive that i want to stay uplifted des...      3
47284  okla man sentenced for hate crime slaying of l...      3
47285  just opened this on a train i really hate twit...      3
47286  we too are dreamers and angry screamers some b...      3

[43924 rows x 2 columns]

In [7]:
df1=pd.read_csv('tweet_emotions.csv')
df1.columns=["id","value","text"]
df1=df1.drop(['id'], axis=1)

In [8]:
df1

            value                                               text
0           empty  @tiffanylue i know  i was listenin to bad habi...
1         sadness  Layin n bed with a headache  ughhhh...waitin o...
2         sadness                Funeral ceremony...gloomy friday...
3      enthusiasm               wants to hang out with friends SOON!
4         neutral  @dannycastillo We want to trade with someone w...
...           ...                                                ...
39995     neutral                                   @JohnLloydTaylor
39996        love                     Happy Mothers Day  All my love
39997        love  Happy Mother's Day to all the mommies out ther...
39998   happiness  @niariley WASSUP BEAUTIFUL!!! FOLLOW ME!!  PEE...
39999        love  @mopedronin bullet train from tokyo    the gf ...

[40000 rows x 2 columns]

In [9]:
df1 = df1.drop_duplicates(subset=['text'], keep='first')

In [10]:
df1

            value                                               text
0           empty  @tiffanylue i know  i was listenin to bad habi...
1         sadness  Layin n bed with a headache  ughhhh...waitin o...
2         sadness                Funeral ceremony...gloomy friday...
3      enthusiasm               wants to hang out with friends SOON!
4         neutral  @dannycastillo We want to trade with someone w...
...           ...                                                ...
39995     neutral                                   @JohnLloydTaylor
39996        love                     Happy Mothers Day  All my love
39997        love  Happy Mother's Day to all the mommies out ther...
39998   happiness  @niariley WASSUP BEAUTIFUL!!! FOLLOW ME!!  PEE...
39999        love  @mopedronin bullet train from tokyo    the gf ...

[39827 rows x 2 columns]

In [11]:
df.dtypes

text     object
value     int64
dtype: object

In [12]:
print(["neutral", "happy", "sad", "hate","anger"])
df.groupby('value').count()

['neutral', 'happy', 'sad', 'hate', 'anger']

        text
value
0       9303
1      15627
2      15357
3       2762
4        874

In [13]:
df['value']= df['value'].replace([0,1,2,3,4],[2,1,3,4,4])

C:\Users\GANAPRIYA\AppData\Local\Temp\ipykernel_14984\222844596.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['value']= df['value'].replace([0,1,2,3,4],[2,1,3,4,4])

In [14]:
df

                                                    text  value
0      sickening i hurt for florida later for the wha...      4
1      this rainfall is a savage y fall when am in d ...      4
2      angry guy screws his gf in very rude manner po...      4
3      silence is better when you re angry and frustr...      4
4      it s your smile which makes me cool and calm w...      4
...                                                  ...    ...
47282  okla man learns fate for hate crime slaying of...      4
47283  i am positive that i want to stay uplifted des...      4
47284  okla man sentenced for hate crime slaying of l...      4
47285  just opened this on a train i really hate twit...      4
47286  we too are dreamers and angry screamers some b...      4

[43924 rows x 2 columns]

In [15]:
df1.groupby('value').count()

            text
value
anger        110
boredom      179
empty        822
enthusiasm   758
fun         1775
happiness   5184
hate        1322
love        3785
neutral     8598
relief      1522
sadness     5154
surprise    2181
worry       8437

In [16]:
df.groupby('value').count()

        text
value
1      15627
2       9303
3      15357
4       3636

In [17]:
df1['value']= df1['value'].replace(['empty', 'sadness', 'enthusiasm', 'neutral', 'worry', 'surprise',
       'love', 'fun', 'hate', 'happiness', 'boredom', 'relief', 'anger'],[4,3,0,2,4,0,0,0,4,0,2,1,4])

C:\Users\GANAPRIYA\AppData\Local\Temp\ipykernel_14984\4228954504.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df1['value']= df1['value'].replace(['empty', 'sadness', 'enthusiasm', 'neutral', 'worry', 'surprise',

In [18]:
df1

       value                                               text
0          4  @tiffanylue i know  i was listenin to bad habi...
1          3  Layin n bed with a headache  ughhhh...waitin o...
2          3                Funeral ceremony...gloomy friday...
3          0               wants to hang out with friends SOON!
4          2  @dannycastillo We want to trade with someone w...
...      ...                                                ...
39995      2                                   @JohnLloydTaylor
39996      0                     Happy Mothers Day  All my love
39997      0  Happy Mother's Day to all the mommies out ther...
39998      0  @niariley WASSUP BEAUTIFUL!!! FOLLOW ME!!  PEE...
39999      0  @mopedronin bullet train from tokyo    the gf ...

[39827 rows x 2 columns]

In [19]:
df1.groupby('value').count()

        text
value
0      13683
1       1522
2       8777
3       5154
4      10691

In [20]:
df2 = pd.concat([df, df1])

In [21]:
df2

                                                    text  value
0      sickening i hurt for florida later for the wha...      4
1      this rainfall is a savage y fall when am in d ...      4
2      angry guy screws his gf in very rude manner po...      4
3      silence is better when you re angry and frustr...      4
4      it s your smile which makes me cool and calm w...      4
...                                                  ...    ...
39995                                   @JohnLloydTaylor      2
39996                     Happy Mothers Day  All my love      0
39997  Happy Mother's Day to all the mommies out ther...      0
39998  @niariley WASSUP BEAUTIFUL!!! FOLLOW ME!!  PEE...      0
39999  @mopedronin bullet train from tokyo    the gf ...      0

[83751 rows x 2 columns]

In [22]:
df2[df2.duplicated(keep=False)]

                                                    text  value
5318                                    cant fall asleep      2
5346                             has work this afternoon      2
5454                still needs another 6 hours of sleep      2
5494                 but now i have no money for a phone      3
5512                                     is a bad friend      3
...                                                  ...    ...
39721      waiting for my mum to come back with me pasty      2
39804  is watching the jonas brothers special on sky ...      2
39916         is going to spend the day with the in laws      2
39955                        has just got out the shower      2
39965                         is heading off to the fair      3

[1510 rows x 2 columns]

In [24]:
df2 = df2.drop_duplicates(subset=['text'])

In [25]:
df2

                                                    text  value
0      sickening i hurt for florida later for the wha...      4
1      this rainfall is a savage y fall when am in d ...      4
2      angry guy screws his gf in very rude manner po...      4
3      silence is better when you re angry and frustr...      4
4      it s your smile which makes me cool and calm w...      4
...                                                  ...    ...
39995                                   @JohnLloydTaylor      2
39996                     Happy Mothers Day  All my love      0
39997  Happy Mother's Day to all the mommies out ther...      0
39998  @niariley WASSUP BEAUTIFUL!!! FOLLOW ME!!  PEE...      0
39999  @mopedronin bullet train from tokyo    the gf ...      0

[82370 rows x 2 columns]

In [26]:
# df2.to_csv('data1.csv', index=False)

In [27]:
df2.groupby('value').count()

        text
value
0      13358
1      17109
2      17628
3      20289
4      13985

In [28]:
df2

                                                    text  value
0      sickening i hurt for florida later for the wha...      4
1      this rainfall is a savage y fall when am in d ...      4
2      angry guy screws his gf in very rude manner po...      4
3      silence is better when you re angry and frustr...      4
4      it s your smile which makes me cool and calm w...      4
...                                                  ...    ...
39995                                   @JohnLloydTaylor      2
39996                     Happy Mothers Day  All my love      0
39997  Happy Mother's Day to all the mommies out ther...      0
39998  @niariley WASSUP BEAUTIFUL!!! FOLLOW ME!!  PEE...      0
39999  @mopedronin bullet train from tokyo    the gf ...      0

[82370 rows x 2 columns]

In [29]:
# df2.to_csv('data1.csv', index=False)

In [30]:
data_majority = df2[df2['value'] == 0]
data_minority_4 = df2[df2['value'] == 4]
data_minority_2 = df2[df2['value'] == 2]
data_minority_1 = df2[df2['value'] == 1]
data_minority_3 = df2[df2['value'] == 3]


# Upsample minority class
data_minority_upsampled_4 = resample(data_minority_4, 
                                 replace=True,     # sample with replacement
                                 n_samples= data_majority.shape[0],    # to match majority class
                                 random_state=123) # reproducible results
data_minority_upsampled_2 = resample(data_minority_2, 
                                 replace=True,     # sample with replacement
                                 n_samples= data_majority.shape[0],    # to match majority class
                                 random_state=123) # reproducible results
data_minority_upsampled_1 = resample(data_minority_1, 
                                 replace=True,     # sample with replacement
                                 n_samples= data_majority.shape[0],    # to match majority class
                                 random_state=123) # reproducible results
data_minority_upsampled_3 = resample(data_minority_3, 
                                 replace=True,     # sample with replacement
                                 n_samples= data_majority.shape[0],    # to match majority class
                                 random_state=123) # reproducible results
 
data_upsampled = pd.concat([data_majority, data_minority_upsampled_3,data_minority_upsampled_2,data_minority_upsampled_4,data_minority_upsampled_1])

In [32]:
data_upsampled.groupby('value').count()

        text
value
0      13358
1      13358
2      13358
3      13358
4      13358

In [37]:
data_upsampled

                                                    text  value
3                   wants to hang out with friends SOON!      0
14                                          Got the news      0
16                                  @annarosekerr agreed      0
21     Wondering why I'm awake at 7am,writing a new s...      0
40     mmm much better day... so far! it's still quit...      0
...                                                  ...    ...
12592               no one i know likes boiled peanuts t      1
30480  good morning hoping to throw back some coffee ...      1
41431  reznor trent don t get mad at me but i keep th...      1
32534  it is certainly spring in vail co it is rainin...      1
39479  george lopez bed mommys day tomorrow i wish ho...      1

[66790 rows x 2 columns]

In [38]:
dic = [['I am not good',3],['I am bad',3] , ['I am not bad',2], ['I am worried',3],['I am not worried',1],['I am good',1],['no good',3],['no bad',2]]
final_data=pd.concat([data_upsampled, pd.DataFrame(dic, columns=data_upsampled.columns)], ignore_index=True)

In [39]:
final_data

                                                    text  value
0                   wants to hang out with friends SOON!      0
1                                           Got the news      0
2                                   @annarosekerr agreed      0
3      Wondering why I'm awake at 7am,writing a new s...      0
4      mmm much better day... so far! it's still quit...      0
...                                                  ...    ...
66793                                       I am worried      3
66794                                   I am not worried      1
66795                                          I am good      1
66796                                            no good      3
66797                                             no bad      2

[66798 rows x 2 columns]

In [40]:
final_data.to_csv("final_dataset.csv")